HELYXcore-4.4.0/modules/swak4Foam/Examples/tests/testFOExecution/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p.potential {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.0;
    }

    scalar
    {
        solver PBiCG;
        preconditioner   DILU;
        tolerance        1e-05;
        relTol           0;
    };
}

p.potential {
    solver           PCG;
    preconditioner   DIC;
    tolerance        1e-6;
    relTol           0.0;
}

potentialFlow {
    nNonOrthogonalCorrectors 10;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}
scalarTransportPDE
{
    $PISO;
}


// ************************************************************************* //
